package main

/*
— В этой библиотеке хранятся книги, каждая книга имеет:
	1. Название
	2. Автора
	З. Количество страниц
	4. Информацию о том, прочитана эта книга нами, либо же нет
	5. Время добавления в библиотеку
	6. Время окончательного прочтения (когда книга была дочитана нами до конца)
— Приложение предоставляет возможность:
	1. Добавлять новые книги в нашу личную библиотеку
	2. Отмечать отдельные книги как прочитанные
	З. Получать информацию о какой-то конкретной книге
	4. Получать список всех книг, с учётом возможной фильтрации по:
	   автору, прочитано/не прочитано
	5. Удалять книги из нашей библиотеки
— Взаимодействие с приложением происходит по протоколу НТТР, 
  контракт приложения должен удовлетворять принципам REST API
*/

func main() {
	
}